app/controllers/transactions_controller.rb

  def create
    @transaction = Transaction.new(transaction_params)

    result = { transaction_id: @transaction.transaction_id }

    if @transaction.save && !DetectFraud.call(@transaction)
---
INSERT INTO "transactions" ("transaction_id", "merchant_id", "user_id", "card_number", "transaction_date", "transaction_amount", "device_id", "has_cbk", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"